app/controllers/admin/forms_controller.rb

  def index
    @forms = Form.includes(:subject, :template).order(created_at: :desc)
---
SELECT "forms".* FROM "forms" ORDER BY "forms"."created_at" DESC

  def show
    @answers = @form.answers.includes(:user, :question)
---
SELECT "answers".* FROM "answers" WHERE "answers"."form_id" = ?  [["form_id", 1]]

  def report
    @answers = @form.answers.includes(:user, :question)

    respond_to do |format|
      format.html

      format.csv do
        if @answers.empty?
---
SELECT 1 AS one FROM "answers" WHERE "answers"."form_id" = ? LIMIT ?  [["form_id", 1], ["LIMIT", 1]]

  def set_form
    @form = Form.find(params[:id])
---
SELECT "forms".* FROM "forms" WHERE "forms"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]