app/controllers/admin/imports_controller.rb

    def import_participants(data)
      data.each do |class_info|
        # Encontra a turma (Subject)
        subject = Subject.joins(:course)
                         .find_by!(
                           courses: { code: class_info['code'] },
                           class_name: class_info['classCode'],
                           semester: class_info['semester']
                         )

        # Importa estudantes (dicentes)
        class_info['dicente'].each do |student|
          user = create_student(student)
          UserSubject.find_or_create_by!(user: user, subject: subject)
---
SELECT "subjects".* FROM "subjects" INNER JOIN "courses" ON "courses"."id" = "subjects"."course_id" WHERE "courses"."code" = 'CIC0097' AND "subjects"."class_name" = 'TA' AND "subjects"."semester" = '2021.2' LIMIT 1
SELECT "user_subjects".* FROM "user_subjects" WHERE "user_subjects"."user_id" = 4 AND "user_subjects"."subject_id" = 4 LIMIT 1

 def create_student(data)
  User.find_or_create_by!(email: data['email']) do |user|
---
SELECT "users".* FROM "users" WHERE "users"."email" = 'acjpjvjp@gmail.com' LIMIT 1