app/controllers/admin/imports_controller.rb

INSERT INTO "courses" ("code", "name", "created_at", "updated_at") VALUES ('CIC0097', 'BANCOS DE DADOS', '2025-07-24 01:00:02.752907', '2025-07-24 01:00:02.752907') RETURNING "id"
SELECT "courses".* FROM "courses" WHERE "courses"."code" = 'CIC0097' LIMIT 1
INSERT INTO "courses" ("code", "name", "created_at", "updated_at") VALUES ('CIC0097', 'BANCOS DE DADOS', '2025-07-22 04:09:37.250207', '2025-07-22 04:09:37.250207') RETURNING "id"
INSERT INTO "subjects" ("class_name", "schedule", "semester", "course_id", "created_at", "updated_at") VALUES ('TA', '35T45', '2021.2', 38, '2025-07-24 01:00:02.813459', '2025-07-24 01:00:02.813459') RETURNING "id"
SELECT "subjects".* FROM "subjects" WHERE "subjects"."course_id" = 38 AND "subjects"."class_name" = 'TA' AND "subjects"."semester" = '2021.2' LIMIT 1
---
    def import_courses(data)
      data.each do |course|
        Rails.logger.info("Importando curso: #{course['code']} - #{course['name']}")

        course_record = Course.find_or_create_by!(code: course['code']) do |c|
          c.name = course['name']
        end

        class_data = course['class']
        subject = Subject.find_or_create_by!(
          course: course_record,
          class_name: class_data['classCode'],
          semester: class_data['semester']
        ) do |s|

SELECT "subjects".* FROM "subjects" INNER JOIN "courses" ON "courses"."id" = "subjects"."course_id" WHERE "courses"."code" = 'CIC0097' AND "subjects"."class_name" = 'TA' AND "subjects"."semester" = '2021.2' LIMIT 1
INSERT INTO "users" ("name", "email", "hash_password", "role", "academic_background", "student_course", "student_enrolment", "professor_departament", "created_at", "updated_at", "username") VALUES ('Ana Clara Jordao Perna', 'acjpjvjp@gmail.com', '$2a$12$cOQRcp1F6ZV5PCz.zeJZdew42PWxA3EM3ULPHzTk1zscTY.qXOTv2', 0, 0, 'CIÊNCIA DA COMPUTAÇÃO/CIC', '190084006', NULL, '2025-07-15 23:42:39.849262', '2025-07-15 23:42:39.849262', '190084006') RETURNING "id"
INSERT INTO "user_subjects" ("user_id", "subject_id", "created_at", "updated_at") VALUES (465, 40, '2025-07-24 01:02:30.205376', '2025-07-24 01:02:30.205376') RETURNING "id"
SELECT "user_subjects".* FROM "user_subjects" WHERE "user_subjects"."user_id" = 465 AND "user_subjects"."subject_id" = 40 LIMIT 1
INSERT INTO "users" ("name", "email", "hash_password", "role", "academic_background", "student_course", "student_enrolment", "professor_departament", "created_at", "updated_at", "username", "password_defined_at", "password_token") VALUES ('Ana Clara Jordao Perna', 'acjpjvjp@gmail.com', '$2a$12$2X/hU.vTyk2FMh2WV5Z3u.QkJFHrfjB.MI6hWoH/n9pUjSRpsyTR6', 0, 0, 'CIÊNCIA DA COMPUTAÇÃO/CIC', '190084006', NULL, '2025-07-16 03:09:25.387513', '2025-07-16 03:09:25.387513', '190084006', NULL, 'xhnsdHnn8BCJNdK31_yEC6G3LvqjkVZnOSBJL45qD9U') RETURNING "id"
INSERT INTO "user_subjects" ("user_id", "subject_id", "created_at", "updated_at") VALUES (466, 40, '2025-07-24 01:02:30.453601', '2025-07-24 01:02:30.453601') RETURNING "id"
SELECT "user_subjects".* FROM "user_subjects" WHERE "user_subjects"."user_id" = 466 AND "user_subjects"."subject_id" = 40 LIMIT 1
---
    def import_participants(data)
      data.each do |class_info|
        Rails.logger.info("Importando participantes para turma #{class_info['classCode']} - Semestre #{class_info['semester']}")

        subject = Subject.joins(:course)
                         .find_by!(
                           courses: { code: class_info['code'] },
                           class_name: class_info['classCode'],
                           semester: class_info['semester']
                         )

        class_info['dicente'].each do |student|
          Rails.logger.info("Importando estudante: #{student['nome']} - #{student['email']}")
          user = create_student(student)
          UserSubject.find_or_create_by!(user: user, subject: subject)
        end

        if class_info['docente']
          Rails.logger.info("Importando docente: #{class_info['docente']['nome']} - #{class_info['docente']['email']}")
          user = create_professor(class_info['docente'])
          UserSubject.find_or_create_by!(user: user, subject: subject)

INSERT INTO "users" ("name", "email", "hash_password", "role", "academic_background", "student_course", "student_enrolment", "professor_departament", "created_at", "updated_at", "username", "password_defined_at", "password_token") VALUES ('Gabriel', 'gabrielrszica0800@gmail.com', '$2a$12$S8JmUiVbHxYnA8GZlStJAegnxLxHnrhJ.g28oxS9bhjMkhqnGVERa', 0, 0, 'ENGENHARIA DE COMPUTAÇÃO/FT', '222005401', NULL, '2025-07-24 01:02:30.047695', '2025-07-24 01:02:30.047695', '222005401', NULL, 'FKxPr2D9LIwzVkiW1ccTrjflPqvYFqBqXm4wrQK6i18') RETURNING "id"
SELECT "users".* FROM "users" WHERE "users"."email" = 'gabrielrszica0800@gmail.com' LIMIT 1
INSERT INTO "users" ("name", "email", "hash_password", "role", "academic_background", "student_course", "student_enrolment", "professor_departament", "created_at", "updated_at", "username", "password_defined_at", "password_token") VALUES ('Ana Clara Jordao Perna', 'acjpjvjp@gmail.com', '$2a$12$c1fB.NVhfNy7Q.2xit2t3OZkOiDA9AUDZ0VfwwuXjfmkboKj2XK2O', 0, 0, 'CIÊNCIA DA COMPUTAÇÃO/CIC', '190084006', NULL, '2025-07-22 04:10:42.020370', '2025-07-22 04:10:42.020370', '190084006', NULL, 'ZgDbWrs3V1M0m5yssAibWgm3YMSt9qeJ6IMc6xDBkNI') RETURNING "id"
---
    def create_student(data)
      Rails.logger.info("Criando ou encontrando estudante com email: #{data['email']}")

      user = User.find_or_create_by!(email: data['email']) do |u|
        u.name = data['nome']
        u.username = data['usuario'] || data['matricula']
        u.role = :student
        u.academic_background = User.map_academic_background(data['formacao'])
        u.student_course = data['curso']
        u.student_enrolment = data['matricula']
        u.password_token = SecureRandom.urlsafe_base64(32)
        u.hash_password = BCrypt::Password.create(SecureRandom.hex(10))

INSERT INTO "users" ("name", "email", "hash_password", "role", "academic_background", "student_course", "student_enrolment", "professor_departament", "created_at", "updated_at", "username", "password_defined_at", "password_token") VALUES ('Janaina', 'exemplo@unb.br', '$2a$12$WKNoTAFxzaOX5mjy7wSdDeYYh7l54XGQZuvbJwlAL/Kpa/3.n8jo.', 1, 0, NULL, NULL, 'DEPTO CIÊNCIAS DA COMPUTAÇÃO', '2025-07-24 01:02:30.427915', '2025-07-24 01:02:30.427915', '00000000', NULL, 'Mlk3Dy3zNgU2mMS2r-aMQ_yX0EDvvXJr0zuwMbXWBIk') RETURNING "id"
SELECT "users".* FROM "users" WHERE "users"."email" = 'exemplo@unb.br' LIMIT 1
INSERT INTO "users" ("name", "email", "hash_password", "role", "academic_background", "student_course", "student_enrolment", "professor_departament", "created_at", "updated_at", "username", "password_defined_at", "password_token") VALUES ('MARISTELA TERTO DE HOLANDA', 'mholanda@unb.br', '$2a$12$WEvmRzyCD/8TcFgp41..SuIUtxkAWJADFxs9HZeUkT3DhSRDSbUGu', 1, 0, NULL, NULL, 'DEPTO CIÊNCIAS DA COMPUTAÇÃO', '2025-07-22 04:10:51.590386', '2025-07-22 04:10:51.590386', '83807519491', NULL, '-sCWA94-mdbq2r5AsMUQ1qt-R3JkwL3ZzR95U6kdjLE') RETURNING "id"
---
    def create_professor(data)
      Rails.logger.info("Criando ou encontrando professor com email: #{data['email']}")

      user = User.find_or_create_by!(email: data['email']) do |u|
        u.name = data['nome']
        u.username = data['usuario']
        u.role = :professor
        u.academic_background = User.map_academic_background(data['formacao'])
        u.professor_departament = data['departamento']
        u.password_token = SecureRandom.urlsafe_base64(32)
        u.hash_password = BCrypt::Password.create(SecureRandom.hex(10))