app/services/admin/create_user_service.rb

INSERT INTO "users" ("name", "email", "hash_password", "role", "academic_background", "student_course", "student_enrolment", "professor_departament", "created_at", "updated_at", "username", "password_defined_at", "password_token") VALUES ('Gabriel', 'gabrielrszica0800@gmail.com', '$2a$12$c8vNeRUEXQLkriwYaEssoe7GjjSsOOEtJ8UdyBEOLX7kNdbvsYZb.', 0, 0, 'ENGENHARIA DE COMPUTAÇÃO/FT', '222005401', NULL, '2025-07-24 13:42:15.268119', '2025-07-24 13:42:15.268119', '222005401', NULL, '-_rQyQUfcmop98LUmm5rFNOGJVCP74mfePOaGplcBZ4') RETURNING "id"
SELECT "users".* FROM "users" WHERE "users"."email" = 'gabrielrszica0800@gmail.com' LIMIT 1
---
    def call
      email = @attrs['email']
      user  = User.find_or_create_by!(email: email) do |u|