app/services/admin/import_participants_service.rb

    def import_for_class(info)
      code, class_code, semester = info.values_at('code', 'classCode', 'semester')
      subject = Subject.joins(:course).find_by!(
        courses: { code: code }, class_name: class_code, semester: semester
      )
---
SELECT "subjects".* FROM "subjects" INNER JOIN "courses" ON "courses"."id" = "subjects"."course_id" WHERE "courses"."code" = 'CIC0097' AND "subjects"."class_name" = 'TA' AND "subjects"."semester" = '2021.2' LIMIT 1

    def import_students(students, subject)
      students.each do |attrs|
        user = Admin::CreateUserService.call(attrs, :student)
        UserSubject.find_or_create_by!(user: user, subject: subject)
---
INSERT INTO "user_subjects" ("user_id", "subject_id", "created_at", "updated_at") VALUES (467, 43, '2025-07-24 13:42:15.460108', '2025-07-24 13:42:15.460108') RETURNING "id"
SELECT "user_subjects".* FROM "user_subjects" WHERE "user_subjects"."user_id" = 467 AND "user_subjects"."subject_id" = 43 LIMIT 1

    def import_professor(docente, subject)
      user = Admin::CreateUserService.call(docente, :professor)
      UserSubject.find_or_create_by!(user: user, subject: subject)
---
INSERT INTO "user_subjects" ("user_id", "subject_id", "created_at", "updated_at") VALUES (468, 49, '2025-07-25 01:11:33.301955', '2025-07-25 01:11:33.301955') RETURNING "id"
SELECT "user_subjects".* FROM "user_subjects" WHERE "user_subjects"."user_id" = 468 AND "user_subjects"."subject_id" = 49 LIMIT 1