app/services/admin/import_courses_service.rb

    def call
      @courses.each do |course_data|
        code, name = course_data.values_at('code', 'name')
        Rails.logger.info("Importando curso: #{code} - #{name}")

        course = Course.find_or_create_by!(code: code) { |c| c.name = name }

        class_info = course_data['class']
        subject = Subject.find_or_create_by!(
          course: course,
          class_name: class_info['classCode'],
          semester: class_info['semester']
        ) { |s| s.schedule = class_info['time'] }
---
INSERT INTO "courses" ("code", "name", "created_at", "updated_at") VALUES ('CIC0097', 'BANCOS DE DADOS', '2025-07-24 13:40:45.262938', '2025-07-24 13:40:45.262938') RETURNING "id"
SELECT "courses".* FROM "courses" WHERE "courses"."code" = 'CIC0097' LIMIT 1
INSERT INTO "subjects" ("class_name", "schedule", "semester", "course_id", "created_at", "updated_at") VALUES ('TA', '35T45', '2021.2', 41, '2025-07-24 13:40:45.358172', '2025-07-24 13:40:45.358172') RETURNING "id"
SELECT "subjects".* FROM "subjects" WHERE "subjects"."course_id" = 38 AND "subjects"."class_name" = 'TA' AND "subjects"."semester" = '2021.2' LIMIT 1