app/views/admin/forms/index.html.erb

      <p><%= form.subject.semester %></p>
      <p><%= form.users.map(&:name).join(', ') %></p>
---
SELECT "users".* FROM "users" INNER JOIN "user_forms" ON "users"."id" = "user_forms"."user_id" WHERE "user_forms"."form_id" = ?  [["form_id", 1]]