app/views/admin/forms/show.html.erb

SELECT "answers".* FROM "answers" WHERE "answers"."form_id" = ?  [["form_id", 1]]
SELECT 1 AS one FROM "answers" WHERE "answers"."form_id" = ? LIMIT ?  [["form_id", 1], ["LIMIT", 1]]
---

    <% if @form.answers.any? %>