app/controllers/senha_definicao_controller.rb

  def edit
    @user = User.find_by(password_token: params[:token])
---
SELECT "users".* FROM "users" WHERE "users"."password_token" = 'jFfRma0ZAMp9SoBifCeqwzLGereMzOhfR-C5TZzi8xs' LIMIT 1

  def update
    @user = User.find_by(password_token: params[:token])
    if @user.nil?
      redirect_to root_path, alert: "Usuário não encontrado."
    elsif params[:password].blank?
      flash.now[:alert] = "Senha não pode estar em branco."
      render :edit
    else
      @user.hash_password = BCrypt::Password.create(params[:password])
      @user.password_defined_at = Time.current
      @user.save!
---
SELECT "users".* FROM "users" WHERE "users"."password_token" = '5iKDcGpE1o0w56HrvFTLPXXHEA09ifQzbEEaWtOw0Ms' LIMIT 1
UPDATE "users" SET "hash_password" = '$2a$12$FEYv7T1mFhXSoGnHrpGKpeg8FgqZkRl4NnrL.rM57v7UyR6JL999W', "updated_at" = '2025-07-20 02:04:15.342568', "password_defined_at" = '2025-07-20 02:04:15.320773' WHERE "users"."id" = 184